use testsql;

-- 创建 Todo 表
CREATE TABLE todo
(
    id                     INT PRIMARY KEY AUTO_INCREMENT,
    title                  VARCHAR(100),
    details                VARCHAR(100),
    isCompleted            TINYINT(1),
    completionDate         VARCHAR(100),
    category               VARCHAR(100),
    isDeleted              TINYINT(1),
    expectedCompletionDate VARCHAR(100),
    isImportant            TINYINT(1),
    isUrgent               TINYINT(1)
);

-- 插入数据
INSERT INTO todo (id, title, details, isCompleted, completionDate, category, isDeleted, expectedCompletionDate,
                  isImportant, isUrgent)
VALUES (1, '整理文件', '整理和清理办公桌，保持整洁。', 1, '2025-02-11', 'Other', 0, '2025-02-11T10:00:00.000Z', 1, 0),
       (2, '编写代码', '编写项目代码。', 1, '2025-02-12', 'Work', 0, '2025-02-11T15:00:00.000Z', 1, 1),
       (3, '学习新技能', '学习一项新技能。', 1, '2025-02-12', 'Study', 0, '2025-02-12T12:00:00.000Z', 0, 0),
       (4, '购物清单', '制定购物清单。', 1, '2025-02-12', 'Social', 0, '2025-02-12T18:00:00.000Z', 0, 1),
       (5, '整理照片', '整理个人照片。', 1, '2025-02-13', 'Other', 0, '2025-02-13T11:00:00.000Z', 1, 0),
       (6, '编写测试用例', '编写项目测试用例。', 1, '2025-02-13', 'Work', 0, '2025-02-13T13:00:00.000Z', 0, 1),
       (7, '学习JavaScript', '深入学习JavaScript。', 0, NULL, 'Study', 0, '2025-02-14T12:00:00.000Z', 1, 0),
       (8, '学习CSS', '学习CSS以提升网站设计技能。', 1, '2025-02-14', 'Study', 0, '2025-02-14T18:00:00.000Z', 1, 1),
       (9, '优化网站', '优化公司网站以提高用户体验。', 0, NULL, 'Work', 1, '2025-02-15T10:00:00.000Z', 0, 0),
       (10, '计划下个月预算', '制定下个月的个人预算。', 0, NULL, 'Social', 1, '2025-02-15T12:00:00.000Z', 0, 0),
       (11, '回复客户邮件', '回复客户关于项目进度的询问邮件。', 1, '2025-02-15', 'Work', 0,
        '2025-02-15T14:30:00.000Z', 1, 0),
       (12, '学习React', '学习React以增强前端开发能力。', 0, NULL, 'Study', 1, '2025-02-15T15:00:00.000Z', 0, 0),
       (13, '健身训练', '进行一小时的健身锻炼。', 1, '2025-02-05', 'Social', 0, '2025-02-15T17:00:00.000Z', 1, 0),
       (14, '学习ES6', '学习ES6以提高代码质量。', 0, NULL, 'Social', 1, '2025-02-16T10:00:00.000Z', 0, 0);


INSERT INTO todo (id, title, details, isCompleted, completionDate, category, isDeleted, expectedCompletionDate,
                  isImportant, isUrgent)
VALUES (15, '阅读技术文章', '阅读并总结三篇与项目相关的技术文章。', 0, NULL, 'Study', 0, '2025-02-16T12:00:00.000Z', 1, 0),
       (16, '团队会议', '参加每周的团队会议，讨论项目进展。', 0, NULL, 'Work', 0, '2025-02-16T14:00:00.000Z', 1, 1),
       (17, '学习Node.js', '学习Node.js以扩展后端开发能力。', 0, NULL, 'Study', 0, '2025-02-17T12:00:00.000Z', 1, 0),
       (18, '整理笔记本', '整理个人笔记本，记录重要信息。', 0, NULL, 'Other', 0, '2025-02-17T18:00:00.000Z', 0, 0),
       (19, '客户拜访', '拜访潜在客户，了解他们的需求。', 0, NULL, 'Work', 0, '2025-02-18T14:00:00.000Z', 1, 1),
       (20, '学习SQL', '学习SQL以提高数据处理能力。', 0, NULL, 'Study', 0, '2025-02-18T16:00:00.000Z', 1, 0),
       (21, '项目文档整理', '整理和完善项目文档。', 0, NULL, 'Work', 1, '2025-02-19T11:00:00.000Z', 1, 0),
       (22, '学习Python', '学习Python以增强数据分析能力。', 0, NULL, 'Study', 0, '2025-02-19T14:00:00.000Z', 0, 0),
       (23, '健身计划', '制定并执行一周的健身计划。', 0, NULL, 'Social', 0, '2025-02-20T17:00:00.000Z', 0, 0),
       (24, '学习HTML5', '学习HTML5以提高网页开发技能。', 0, NULL, 'Study', 0, '2025-02-20T12:00:00.000Z', 0, 0),
       (25, '竞争对手分析', '分析主要竞争对手的产品和市场策略。', 0, NULL, 'Work', 0, '2025-02-21T10:00:00.000Z', 1, 1),
       (26, '学习TypeScript', '学习TypeScript以提高代码的可维护性和可读性。', 0, NULL, 'Study', 0, '2025-02-21T14:00:00.000Z', 0, 0),
       (27, '个人时间规划', '规划每周的个人时间，包括休息和娱乐。', 0, NULL, 'Other', 0, '2025-02-22T18:00:00.000Z', 0, 0),
       (28, '学习Vue.js', '学习Vue.js以增加前端开发工具箱。', 0, NULL, 'Study', 0, '2025-02-22T12:00:00.000Z', 0, 0),
       (29, '市场调研', '进行市场调研，收集行业信息和趋势。', 0, NULL, 'Work', 0, '2025-02-23T10:00:00.000Z', 1, 0),
       (30, '学习Git', '学习Git以提高版本控制能力。', 0, NULL, 'Study', 0, '2025-02-23T14:00:00.000Z', 0, 1);

show variables like '%datadir%';
